MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX110F016D.atdf
         <register caption="Interrupt Priority Control Register" name="IPC6" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="FSCMIS" />
            <bitfield mask="0x0000001C" name="FSCMIP" />
            <bitfield mask="0x00000300" name="RTCCIS" />
            <bitfield mask="0x00001C00" name="RTCCIP" />
            <bitfield mask="0x00030000" name="FCEIS" />
            <bitfield mask="0x001C0000" name="FCEIP" />
            <bitfield mask="0x03000000" name="CMP1IS" />
            <bitfield mask="0x1C000000" name="CMP1IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC7" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CMP2IS" />
            <bitfield mask="0x0000001C" name="CMP2IP" />
            <bitfield mask="0x00000300" name="CMP3IS" />
            <bitfield mask="0x00001C00" name="CMP3IP" />
            <bitfield mask="0x00030000" name="USBIS" />
            <bitfield mask="0x001C0000" name="USBIP" />
            <bitfield mask="0x03000000" name="SPI1IS" />
            <bitfield mask="0x1C000000" name="SPI1IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC8" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U1IS" />
            <bitfield mask="0x0000001C" name="U1IP" />
            <bitfield mask="0x00000300" name="I2C1IS" />
            <bitfield mask="0x00001C00" name="I2C1IP" />
            <bitfield mask="0x00030000" name="CNIS" />
            <bitfield mask="0x001C0000" name="CNIP" />
            <bitfield mask="0x03000000" name="PMPIS" />
            <bitfield mask="0x1C000000" name="PMPIP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC9" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI2IS" />
            <bitfield mask="0x0000001C" name="SPI2IP" />
            <bitfield mask="0x00000300" name="U2IS" />
            <bitfield mask="0x00001C00" name="U2IP" />
            <bitfield mask="0x00030000" name="I2C2IS" />
            <bitfield mask="0x001C0000" name="I2C2IP" />
            <bitfield mask="0x03000000" name="CTMUIS" />
            <bitfield mask="0x1C000000" name="CTMUIP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC10" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA0IS" />
            <bitfield mask="0x0000001C" name="DMA0IP" />
            <bitfield mask="0x00000300" name="DMA1IS" />
            <bitfield mask="0x00001C00" name="DMA1IP" />
            <bitfield mask="0x00030000" name="DMA2IS" />
            <bitfield mask="0x001C0000" name="DMA2IP" />
            <bitfield mask="0x03000000" name="DMA3IS" />
            <bitfield mask="0x1C000000" name="DMA3IP" />
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7" />
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6" />
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5" />
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4" />
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3" />
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2" />
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1" />
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for Multi-vectored mode" name="" value="0x1" />
         <value caption="Interrupt controller configured for Single-vectored mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Vector bits" name="INTSTAT__VEC">
         <value caption="The interrupt vector 0 is presented to the CPU" name="" value="0x00" />
         <value caption="The interrupt vector 1 is presented to the CPU" name="" value="0x01" />
         <value caption="The interrupt vector 2 is presented to the CPU" name="" value="0x02" />
         <value caption="The interrupt vector 3 is presented to the CPU" name="" value="0x03" />
         <value caption="The interrupt vector 4 is presented to the CPU" name="" value="0x04" />
         <value caption="The interrupt vector 5 is presented to the CPU" name="" value="0x05" />
         <value caption="The interrupt vector 6 is presented to the CPU" name="" value="0x06" />
         <value caption="The interrupt vector 7 is presented to the CPU" name="" value="0x07" />
         <value caption="The interrupt vector 8 is presented to the CPU" name="" value="0x08" />
         <value caption="The interrupt vector 9 is presented to the CPU" name="" value="0x09" />
         <value caption="The interrupt vector 10 is presented to the CPU" name="" value="0x0A" />
         <value caption="The interrupt vector 11 is presented to the CPU" name="" value="0x0B" />
         <value caption="The interrupt vector 12 is presented to the CPU" name="" value="0x0C" />
         <value caption="The interrupt vector 13 is presented to the CPU" name="" value="0x0D" />
         <value caption="The interrupt vector 14 is presented to the CPU" name="" value="0x0E" />
         <value caption="The interrupt vector 15 is presented to the CPU" name="" value="0x0F" />
         <value caption="The interrupt vector 16 is presented to the CPU" name="" value="0x10" />
         <value caption="The interrupt vector 17 is presented to the CPU" name="" value="0x11" />
         <value caption="The interrupt vector 18 is presented to the CPU" name="" value="0x12" />
         <value caption="The interrupt vector 19 is presented to the CPU" name="" value="0x13" />
         <value caption="The interrupt vector 20 is presented to the CPU" name="" value="0x14" />
         <value caption="The interrupt vector 21 is presented to the CPU" name="" value="0x15" />
         <value caption="The interrupt vector 22 is presented to the CPU" name="" value="0x16" />
         <value caption="The interrupt vector 23 is presented to the CPU" name="" value="0x17" />
         <value caption="The interrupt vector 24 is presented to the CPU" name="" value="0x18" />
         <value caption="The interrupt vector 25 is presented to the CPU" name="" value="0x19" />
         <value caption="The interrupt vector 26 is presented to the CPU" name="" value="0x1A" />
         <value caption="The interrupt vector 27 is presented to the CPU" name="" value="0x1B" />
         <value caption="The interrupt vector 28 is presented to the CPU" name="" value="0x1C" />
         <value caption="The interrupt vector 29 is presented to the CPU" name="" value="0x1D" />
         <value caption="The interrupt vector 30 is presented to the CPU" name="" value="0x1E" />
         <value caption="The interrupt vector 31 is presented to the CPU" name="" value="0x1F" />
         <value caption="The interrupt vector 32 is presented to the CPU" name="" value="0x20" />
         <value caption="The interrupt vector 33 is presented to the CPU" name="" value="0x21" />
         <value caption="The interrupt vector 34 is presented to the CPU" name="" value="0x22" />
         <value caption="The interrupt vector 35 is presented to the CPU" name="" value="0x23" />
         <value caption="The interrupt vector 36 is presented to the CPU" name="" value="0x24" />
         <value caption="The interrupt vector 37 is presented to the CPU" name="" value="0x25" />
         <value caption="The interrupt vector 38 is presented to the CPU" name="" value="0x26" />
         <value caption="The interrupt vector 39 is presented to the CPU" name="" value="0x27" />
         <value caption="The interrupt vector 40 is presented to the CPU" name="" value="0x28" />
         <value caption="The interrupt vector 41 is presented to the CPU" name="" value="0x29" />
         <value caption="The interrupt vector 42 is presented to the CPU" name="" value="0x2A" />
         <value caption="The interrupt vector 43 is presented to the CPU" name="" value="0x2B" />
         <value caption="The interrupt vector 44 is presented to the CPU" name="" value="0x2C" />
         <value caption="The interrupt vector 45 is presented to the CPU" name="" value="0x2D" />
         <value caption="The interrupt vector 46 is presented to the CPU" name="" value="0x2E" />
         <value caption="The interrupt vector 47 is presented to the CPU" name="" value="0x2F" />
         <value caption="The interrupt vector 48 is presented to the CPU" name="" value="0x30" />
         <value caption="The interrupt vector 49 is presented to the CPU" name="" value="0x31" />
         <value caption="The interrupt vector 50 is presented to the CPU" name="" value="0x32" />
         <value caption="The interrupt vector 51 is presented to the CPU" name="" value="0x33" />
         <value caption="The interrupt vector 52 is presented to the CPU" name="" value="0x34" />
         <value caption="The interrupt vector 53 is presented to the CPU" name="" value="0x35" />
         <value caption="The interrupt vector 54 is presented to the CPU" name="" value="0x36" />
         <value caption="The interrupt vector 55 is presented to the CPU" name="" value="0x37" />
         <value caption="The interrupt vector 56 is presented to the CPU" name="" value="0x38" />
         <value caption="The interrupt vector 57 is presented to the CPU" name="" value="0x39" />
         <value caption="The interrupt vector 58 is presented to the CPU" name="" value="0x3A" />
         <value caption="The interrupt vector 59 is presented to the CPU" name="" value="0x3B" />
         <value caption="The interrupt vector 60 is presented to the CPU" name="" value="0x3C" />
         <value caption="The interrupt vector 61 is presented to the CPU" name="" value="0x3D" />
         <value caption="The interrupt vector 62 is presented to the CPU" name="" value="0x3E" />
         <value caption="The interrupt vector 63 is presented to the CPU" name="" value="0x3F" />
      </value-group>
